# Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.

# a= int(input("Введите число "))
# b=int(input("Введите степень этого числа  "))
# def fun(a, b):
#     if b == 0:
#         return 1
#     if b < 0:
#         return 0

#     return a * fun (a , b-1)

# print(fun(a, b))


#  Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. 
# Также нельзя использовать циклы.

# a=int(input("Введите целое неотрицательное число "))
# b= int(input("Введите второе целое неотрицательное  число "))

# def sum(a,b):
#     if a < 0 and b < 0:
#         return "Введите целое неотрицательное число!!!"
#     return (a+b)

# print(sum(a,b))
